<?php
require_once("setting.php");

header( "Content-Type: text/html; charset=utf-8" );

// データベースに接続する
require_once("db_connect.php");
require_once("model.php");

// ***********************************
// SQL 文字列
// ***********************************
$sql = <<<QUERY
select
    社員コード,
    氏名,
    フリガナ,
    所属,
    性別,
    作成日,
    更新日,
    給与,
    手当,
    管理者,
    strftime('%Y-%m-%d', 生年月日) as 生年月日
from 社員マスタ
where 氏名 like :name
order by 社員コード
QUERY;

// ***********************************
// 準備
// ***********************************
$statement = $pdo->prepare($sql);

// ***********************************
// バインド
// ***********************************
$statement->bindValue(':name', "%{$_REQUEST["name"]}%", PDO::PARAM_STR);

// ***********************************
// 実行
// ***********************************
$statement->execute();

// ***********************************
// 読込み
// ***********************************
$html = get_table( $statement );

// ***********************************
// 終了処理
// ***********************************
$statement = null;
$pdo = null;

// ***********************************
// 画面
// ***********************************
require_once("syain-view.php");

?>